In [5]:
data = {
    "name" : ["Jose","Nahambo","Lubota","Apocalipse"],
    "Category" : ["First_name","Middle_name","Surname", "Uknown"]
}

In [ ]:
import pandas as pd

df = pd.DataFrame(data)

In [7]:
df.head()

         name     Category
0        Jose   First_name
1     Nahambo  Middle_name
2      Lubota      Surname
3  Apocalipse       Uknown

In [9]:
dummy_variable= pd.get_dummies(df["Category"])
dummy_variable

   First_name  Middle_name  Surname  Uknown
0           1            0        0       0
1           0            1        0       0
2           0            0        1       0
3           0            0        0       1

In [10]:
df = pd.concat([df, dummy_variable], axis=1)
df

         name     Category  First_name  Middle_name  Surname  Uknown
0        Jose   First_name           1            0        0       0
1     Nahambo  Middle_name           0            1        0       0
2      Lubota      Surname           0            0        1       0
3  Apocalipse       Uknown           0            0        0       1

In [1]:
x="computer"
"comp" in x

True